<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #CC9900;
}
.Estilo1 {font-family: "Century Gothic"}
.Estilo2 {
	font-family: "Century Gothic";
	font-size: 24px;
	font-weight: bold;
}
-->
</style></head>

<body>
<form id="form1" name="form1" method="post" action="">
  <p align="center" class="Estilo2">ANALIZAR LOS DIFERENTES  SISTEMAS OPERATIVOS E INSTALACI&Oacute;N DE SOFTWARE SEG&Uacute;N LOS REQUERIMIENTOS</p>
  <p align="justify" class="Estilo1">Los tres sistemas operativos m&aacute;s  comunes son Microsoft Windows, Apple Mac OS X y Linux y, vienen instalados en  el ordenador antes de que t&uacute; lo compres. La mayor&iacute;a de los usuarios emplean el  S.O. que viene de serie con el ordenador, aunque se puede sustituir o cambiar,  en el caso de que quieras otro.<br />
    Lo bueno de estos S.O. es la  interfaz gr&aacute;fica de usuario, con la que vienen programados. La interfaz gr&aacute;fica  de usuario es la que permite que todo se muestre de forma clara en la pantalla  y que puedas interactuar con los diferentes men&uacute;s e &iacute;conos con un simple click.<br />
  <strong>1.-  Windows</strong><br />
  &nbsp;Vamos a ver una lista de las diferentes  versiones de Windows que Microsoft lanz&oacute;: El sistema operativo m&aacute;s popular del  mundo en mitad de la d&eacute;cada de 1980.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
    Disk Operating System (D.O.S.): Disk  Operating System o D.O.S. por sus siglas en ingl&eacute;s, fue el primer sistema  operativo que desarroll&oacute; Microsoft. A finales de los 80 consigui&oacute; una gran  popularidad y pr&aacute;cticamente todos los pc se fabricaban con el objetivo de  funcionar en este sistema operativo.<br />
    mouse. De hecho, el rat&oacute;n agiliz&oacute;  mucho el proceso de interacci&oacute;n del usuario con el pc.<br />
    Windows 95: Fue lanzado el 24 de  agosto de 1995 y supuso un nuevo impulso para Microsoft por su buena acogida en  el mercado. Tuvo una buena acogida porque fue lanzado en la &eacute;poca en la que los  PC comenzaron a estar en auge y porque supuso una gran mejora en comparaci&oacute;n  con el Windows 3.1, en especial la interfaz gr&aacute;fica de usuario, mucho m&aacute;s moderna  y amena. De hecho, este Windows fue el primero en incluir la barra de tareas o  el bot&oacute;n de inicio. Adem&aacute;s tambi&eacute;n se realiz&oacute; por parte de Microsoft una buena  (y muy cara) campa&ntilde;a de marketing y publicidad. Si quieres conocer m&aacute;s sobre la  historia de Windows 95 puedes hacerlo aqu&iacute;. Microsoft fue mejorando su Sistema  Operativo, las siguientes versiones de Windows hasta la actualidad son:<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows 98<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows Me<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows XP<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows Vista<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows  7<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows  8<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows  10<br />
    Tambi&eacute;n hay una versi&oacute;n de este S.O.  conocida como Windows New Technology que se orientaba m&aacute;s a zonas de trabajo.  Contaba con dos versiones, la conocida como Workstation (para ser empleada en  zonas de trabajo) y la versi&oacute;n Server (empleada para montarse en servidores de  red).</p>
  <p align="justify" class="Estilo1"><strong>2.-  MAC OS</strong><br />
  &nbsp;Son los sistemas operativos creados por la  compa&ntilde;&iacute;a Apple y que son exclusivos de su l&iacute;nea de productos, no  distribuy&eacute;ndose a terceros. Al igual que Windows, MAC OS tambi&eacute;n ha sido  actualizando con el paso de los a&ntilde;os, con versiones como, por ejemplo, las  siguientes:<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MAC OS X v10.0 &ldquo;Cheetah&rdquo;<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Snow Leopard<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Lion<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Yosemite<br />
    Resulta curioso como Apple llam&oacute; a  las versiones de sus S.O. como algunos felinos, no obstante, esto cambi&oacute; a  partir de la versi&oacute;n 10.9, conocida coloquialmente como Mavericks, donde Apple  cambi&oacute; el rumbo y comenz&oacute; a llamar a sus S.O. como zonas de California.<br />
  <strong>3.-  Linux</strong><br />
    Linux es un sistema operativo de  c&oacute;digo abierto, esto quiere decir que cualquier persona tiene licencia para  modificarlo o distribuirlo sin ning&uacute;n tipo de problema. A diferencia de los dos  S.O. anteriormente mencionados, (MAC Y WINDOWS) Linux es gratuito y al ser  modificable por particulares, existen muchas versiones diferentes. Las  versiones m&aacute;s populares de Linux son:<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ubuntu<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Mint<br />
  &bull;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fedora<br />
    Se conoce como Linux en honor a  quien lo ide&oacute;, Linus Torvalds, que fue la persona que cre&oacute; el n&uacute;cleo de este  S.O. en 1991.</p>
  <p align="justify" class="Estilo1"><strong>Otros  sistemas operativos</strong><br />
    Estos son los sistemas operativos  m&aacute;s populares, no obstante, existen otros (o, por lo menos existieron) de los  que no nos queremos olvidar:<br />
    OS/2<br />
    Fue el intento de IBM de competir  contra Microsoft y su primer sistema operativo (D.O.S.), sin embargo, tuvo una  mala acogida en el mercado, dado que no tuvieron el apoyo de los creadores de  software, puesto que todos los desarrolladores se volcaron en la creaci&oacute;n de  programas para Windows.<br />
    Unix<br />
    Unix fue creado por la compa&ntilde;&iacute;a  AT&amp;T y se trata de un sistema operativo tanto multitarea como multiusuario.  Como curiosidad, el sistema operativo de Apple (MAC OS) se basa en el S.O. de  Unix.</p>
  <p align="justify" class="Estilo1">&nbsp;</p>
  <p align="center" class="Estilo1"><img src="tabla07.jpg" width="480" height="1541" /></p>
  <p align="justify"><span class="Estilo2">FRECUENCIA  PARA DATOS NO AGRUPADOS</span></p>
  <p align="justify"><span class="Estilo1"><br />
    Es el conjunto de datos obtenidos en  la recopilaci&oacute;n y una vez que se han recopilado los datos, el siguiente paso es  organizarlos. </span></p>
  <p align="justify" class="Estilo1"><strong>TABLA DE FRECUENCIAS</strong><br />
    Lo datos obtenidos durante la  recopilaci&oacute;n se organiza en una tabla llamada &ldquo;Tabla de frecuencias o  distribuci&oacute;n de frecuencias simple&rdquo;.</p>
  <p align="justify" class="Estilo1"><strong>FRECUENCIA</strong><br />
    En una preparatoria se les hizo una  encuesta a 23 profesores, pregunt&aacute;ndoles cual es el sistema operativo que  utilizan con m&aacute;s frecuencia y estos fueron los resultados.</p>
  <p align="center" class="Estilo1"><img src="tabla08.jpg" width="608" height="261" /></p>
  <p align="center" class="Estilo1"><img src="tabla09.jpg" width="862" height="582" /></p>
  <p align="justify" class="Estilo1">&nbsp;</p>
</form>
</body>
</html>
