<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #CC9900;
}
.Estilo1 {font-family: "Century Gothic"}
.Estilo2 {font-size: 24px}
-->
</style></head>

<body>
<form action="" method="post" name="form1" class="Estilo1" id="form1">
  <p align="center"><span class="Estilo2"><strong>Historia  y evoluci&oacute;n de los sistemas operativos.</strong><br />
  </span></p>
  <p align="justify"><strong>&iquest;Qu&eacute; es un sistema operativo?</strong><br />
    Es el conjunto de programas  inform&aacute;ticos que permite la administraci&oacute;n eficaz de los recursos de una  computadora es conocido como un sistema operativo (S.O.) o software de  sistemas. Estos programas comienzan a trabajar apenas se enciende el equipo, ya  que gestiona el hardware desde los niveles m&aacute;s b&aacute;sicos y permite adem&aacute;s la  interacci&oacute;n con el usuario.<br />
  </p>
  <p align="justify"><strong>Lista de a&ntilde;os de los Sistemas Operativos </strong><br />
  <strong>1956:</strong> <strong>GM-NAA</strong> I/O (de sistema de entrada/salida de General Motors y North American Aviation)  es el primer sistema operativo de la historia de la inform&aacute;tica.</p>
  <p align="justify"><strong>1961</strong> <strong>CTSS</strong>, (Sistema de  Tiempo Compartido Compatible), fue uno de los primeros sistemas operativos de  tiempo compartido; fue desarrollado en el Centro de Computaci&oacute;n del MIT. Se  utiliz&oacute; en el MIT hasta 1973. Durante parte de este tiempo, el Proyecto MAC del  MIT tuvo una segunda copia de CTSS, pero el sistema no se expandi&oacute; m&aacute;s all&aacute; de  dos sitios. CTSS fue descrito en una publicaci&oacute;n presentada en la Spring Joint  Computer Conference de 1962.</p>
  <p align="justify"><strong>1962</strong> <strong>EXEC II</strong> fue un SO de  tipo Procesamiento por lotes (batch), desarrollado para la computadora UNIVAC  1107 por CSC (Computer Sciences Corporation). Re&uacute;ne todos los trabajos comunes  para ejecutarlos al mismo tiempo, evitando las colas de espera de dos o m&aacute;s  trabajos, como sucede en el procesamiento en serie.</p>
  <p align="justify"><strong>1964</strong> <strong>EXEC 8</strong> era el SO UNIVAC desarrollado para  el UNIVAC 1108 en 1964. Se combinan las mejores caracter&iacute;sticas de los sistemas  operativos anteriores. Fue uno de los primeros SO de multiprocesamiento con  &eacute;xito comercial. Soportaba cargas de trabajo mixto simult&aacute;neo que comprend&iacute;an  procesamiento por lotes, tiempo compartido y en tiempo real. Soportaba un  sistema de archivos con un tipo de estructura a trav&eacute;s de muchos tambores y/o  cabezales. Soportaba un sistema de procesamiento de transacciones muy bien  recibido.</p>
  <p align="justify"><strong>1964</strong> Aparece <strong>MULTICS</strong>.  Originalmente era un proyecto cooperativo liderado por Fernando J. Corbat&oacute; del  MIT, con General Electric y los laboratorios Bell, convirti&eacute;ndolo en uno de los  pocos SO escritos en un lenguaje de alto nivel. En el campo de la programaci&oacute;n  l&oacute;gica se dio a luz la primera implementaci&oacute;n de Prolog, y en la revolucionaria  orientaci&oacute;n a objetos, Smalltalk.</p>
  <p align="justify"><strong>1969</strong> <strong>UNIX</strong> (registrado  oficialmente como UNIX&reg;), es un sistema operativo portable, multitarea y  multiusuario; desarrollado por un grupo de empleados de los laboratorios Bell  de AT&amp;T, entre los que figuran Ken Thompson, Dennis Ritchie y Douglas  McIlroy. La base de la gran mayor&iacute;a de los SO que existen hoy en d&iacute;a.  </p>
  <p align="justify"><strong>1972</strong> <strong>VM/CMS</strong> es un SO de  m&aacute;quina virtual que se anunci&oacute; para el p&uacute;blico en 1972 por IBM para  computadores centrales o mainframes, plataformas como System/370, System/390,  zSeries, System Z9 adem&aacute;s de otros sistemas compatibles como el emulador  H&eacute;rcules.</p>
  <p align="justify"><strong>1972</strong> <strong>RDOS</strong> (en tiempo real Sistema Operativo de Disco) era un SO en tiempo real lanzado  para el popular Data General Nova y minicomputadoras de Eclipse. ORD era capaz  de realizar m&uacute;ltiples tareas, con la capacidad de ejecutar hasta 32  &quot;tareas&quot; de forma simult&aacute;nea en cada una de dos razones (en primer  plano y el fondo) dentro de un espacio de memoria de 64 KB. </p>
  <p align="justify"><strong>1972</strong> <strong>MVT</strong> Multiprogramaci&oacute;n con un  n&uacute;mero de tareas variable (MVT) era el m&aacute;s sofisticado de tres configuraciones  disponibles del OS/360'. Alternadamente, OS/360 era el SO para IBM System/360  l&iacute;nea de computadoras. Las versiones tempranas ten&iacute;an muchos problemas y el m&aacute;s  simple MFT continu&oacute; siendo utilizado por muchos.</p>
  <p align="justify"><strong>1976</strong> <strong>CP/M</strong> (Control Program for  Microcomputers) fue un SO desarrollado por Gary Kildall para el microprocesador  Intel 8080 (los Intel 8085 y Zilog Z80 pod&iacute;an ejecutar directamente el c&oacute;digo  del 8080, aunque lo normal era que se entregara el c&oacute;digo recompilado para el  microprocesador de la m&aacute;quina). Se trataba del sistema operativo m&aacute;s popular  entre las computadoras personales en los a&ntilde;os 70.</p>
  <p align="justify"><strong>1978</strong> <strong>Apple DOS</strong> o APPLE II fue un  SO para la serie de microordenadores de la serie Apple II fue lanzado a partir  de finales de 1978. </p>
  <p align="justify"><strong>1979</strong> <strong>NLTSS</strong>, el sistema de tiempo  compartido de red Livermore, tambi&eacute;n a veces conocido como el Sistema de Tiempo  Compartido Nueva Livermore era un SO que se ha desarrollado de forma activa en  el Lawrence Livermore Laboratory. NLTSS funcion&oacute; inicialmente en un CDC 7600  ordenador, pero s&oacute;lo se ejecut&oacute; la producci&oacute;n de alrededor de 1985 hasta 1994  en Cray computadoras, incluyendo el Cray-1, Cray X-MP y Cray Y-MP modelos.</p>
  <p align="justify"><strong>1980</strong> <strong>SOS</strong> fue el SO de la computadora  personal de Apple III. Fue desarrollado por Apple Inc. y lanzado en 1980. El SOS  se diferenciaba de los otros sistemas de la &eacute;poca que operaba con una &quot;  interfaz de l&iacute;nea de comandos debido a que los recursos de la computadora  podr&iacute;an ser ofrecidos al usuario en la forma de una ' interfaz con semigr&aacute;fica  men&uacute; desplegable , el paquete de software llamado &quot;Sistema Utilidades  &quot;divididos en 3 categor&iacute;as: Comandos para la administraci&oacute;n de  dispositivos, Comandos para la gesti&oacute;n de archivos, SCP (programa de  configuraci&oacute;n del sistema) <br />
    QDOS (&quot;Quick and Dirty Operating System&quot;) es lo que se traduce en  espa&ntilde;ol como &quot;Sistema OperativoR&aacute;pido y Sucio&quot;. </p>
  <p align="justify"><strong>1983</strong> La compa&ntilde;&iacute;a espa&ntilde;ola Omega Systems ha presentado en el mercado de  nuestro pa&iacute;s el SO <strong>Coherent</strong>, un  sistema compatible con los m&aacute;s importantes entornos Unix, pero basado en c&oacute;digo  propietario. Se trata de una plataforma ideada para peque&ntilde;os grupos de trabajo  que requieren las prestaciones de Unix.</p>
  <p align="justify"><strong>1984</strong> <strong>QNX</strong> (pronunciado Q.N.X. o  Quiu-nex) es un SO de tiempo real de tipo Unix que cumple con la norma POSIX.<br />
    Es desarrollado principalmente para su uso en sistemas embebidos. </p>
  <p align="justify"><strong>1985</strong> <strong>NeXTSTEP</strong> es el SO orientado  a objetos, multitarea que NeXT Computer, Inc. dise&ntilde;&oacute; para ser ejecutados en los  computadores NeXT.</p>
  <p align="justify"><strong>1986</strong> <strong>HP-UX</strong> es la versi&oacute;n de Unix  desarrollada y mantenida por Hewlett-Packard desde 1983, ejecutable t&iacute;picamente  sobre procesadores HP PA RISC y en sus &uacute;ltimas versiones sobre Intel Itanium  (arquitectura Intel de 64 bits); a pesar de estar basada ampliamente en System  V incorpora importantes caracter&iacute;sticas BSD.</p>
  <p align="justify"><strong>1987</strong> <strong>IRIX</strong> es un SO compatible con  Unix, creado por Silicon Graphics para su plataforma MIPS de 64 bits.<br />
    IRIX tiene un particular soporte para gr&aacute;ficos 3D, video y transferencia de  datos de gran ancho de banda. Fue una de las primeras versiones de Unix en  tener una interfaz gr&aacute;fica de usuario (GUI) para el escritorio principal y fue  ampliamente utilizado. </p>
  <p align="justify"><strong>1988</strong> <strong>A/UX</strong> (de Apple Unix) fue una  implementaci&oacute;n del sistema operativo Unix desarrollada por Apple Computer para  algunas de sus computadoras Macintosh.<br />
    LynxOS RTOS es un SO de tiempo real tipo Unix de LynuxWorks  (anteriormente &quot;Lynx Real-Time Systems&quot;). En 1988-89, una versi&oacute;n de  LynxOS que se hizo para una arquitectura Intel 80386.</p>
  <p align="justify"><strong>1989</strong> <strong>RISC OS</strong> es un SO  desarrollado por Acorn Computers una compa&ntilde;&iacute;a brit&aacute;nica <br />
    que dej&oacute; de existir, fue hecho para computadoras de  escritorio basado en los chips ARM. RISC OS fue dise&ntilde;ado en Cambridge,  Inglaterra, por Acorn Computers para el chip ARM de 32 bits basado en Acorn  Archimedes y publicado en su primera versi&oacute;n en 1987 como el sistema operativo  Arthur.  </p>
  <p align="justify"><strong>1990</strong> Microsoft anuncia <strong>Windows 3.0</strong>.  Ahora tiene un rendimiento mucho mejor, gr&aacute;fico avanzado con 16 colores e  iconos mejorados. Una nueva ola de equipos para el procesador Intel 386. Los  programas se ejecutan notoriamente m&aacute;s r&aacute;pido.</p>
  <p align="justify"><strong>1991</strong> A pesar de que Linux es, en sentido estricto, el n&uacute;cleo del SO, parte  fundamental de la interacci&oacute;n entre el hardware y el usuario (o los programas  de aplicaci&oacute;n) se maneja usualmente con las herramientas del proyecto <strong>GNU</strong> y con entornos de escritorio basados  en GNOME, que tambi&eacute;n forma parte del proyecto GNU aunque tuvo un origen  independiente. Sin embargo, una parte significativa de la comunidad, as&iacute; como  muchos medios generales y especializados, prefieren utilizar el t&eacute;rmino Linux  para referirse a la uni&oacute;n de ambos proyectos.</p>
  <p align="justify"><strong>1992</strong> <strong>Solaris</strong> es un SO de tipo  Unix desarrollado desde 1992 inicialmente por Sun Microsystems y actualmente  porOracle Corporation como sucesor de SunOS. Es un sistema certificado  oficialmente como versi&oacute;n de Unix. Funciona en arquitecturas SPARC y x86 para  servidores y estaciones de trabajo.</p>
  <p align="justify"><strong>1993 FreeBSD</strong> al igual que varios otros sistemas inspirados en BSD, provee de manejo  semi-automatizado de paquetes distribuidos en formato comprimido (en formato  tar.bz o .tbz). Adem&aacute;s de eso, y al igual que NetBSD y OpenBSD, FreeBSD provee  para conveniencia del usuario, de un eficiente sistema de gesti&oacute;n de paqueter&iacute;a  llamado ports</p>
  <p align="justify"><strong>1995</strong> <strong>OpenBSD</strong> es un SO libre tipo  Unix multi-plataforma, basado en 4.4 BSD. Es un descendiente de NetBSD, con un  foco especial en la seguridad y la criptograf&iacute;a.</p>
  <p align="justify"><strong>WINDOWS 95</strong> Fue un SO con interfaz gr&aacute;fica de usuario h&iacute;brido de entre 16 y 32bits.  Fue lanzado al mercado el 24 de agosto de 1995 por la empresa de software  Microsoft con notable &eacute;xito de ventas.</p>
  <p align="justify"><strong>1996</strong> <strong>Windows NT 4.0</strong> Fue la cuarta  versi&oacute;n del SO de Microsoft Windows NT, lanzado en 1996. Es un sistema Windows  de 32-bit disponible para estaciones de trabajo y versiones para servidores con  una interfaz gr&aacute;fica similar a la de Windows 95. </p>
  <p align="justify"><strong>1997</strong> <strong>Mac OS 7.6 System</strong> 7 (nombre  clave Big Bang y a veces llamado Mac OS 7) es una versi&oacute;n de Mac OS, el sistema  operativo de los ordenadores personales Macintosh introducido el 13 de mayo de  1991. Sucede al System 6, y fue el principal sistema operativo del Mac hasta  ser sustituido por Mac OS 8 en 1997.</p>
  <p align="justify"><strong>1998</strong> <strong>Windows 98</strong> Cuyo nombre en  clave es Memphis fue un SO gr&aacute;fico publicado el 25 de junio de 1998 por  Microsoft y el sucesor de Windows 95. Como su predecesor, es un producto  monol&iacute;tico h&iacute;brido de 16 y 32 bits.  </p>
  <p align="justify"><strong>2000</strong> <strong>AtheOS</strong>, acr&oacute;nimo de Athena  Operating System, era un SO de c&oacute;digo abierto para plataforma Intel x86. Al  principio AtheOS pretend&iacute;a ser un clon de Amigaos.</p>
  <p align="justify"><strong>Windows 2000</strong> es un SO de Microsoft que se puso en circulaci&oacute;n el 17 de febrero de  2000 con un cambio de nomenclatura para su sistema NT.</p>
  <p align="justify"><strong>2001</strong> <strong>Windows XP</strong> Cuyo nombre en  clave inicial fue Whistler es una versi&oacute;n de Microsoft Windows, l&iacute;nea de SO  desarrollado por Microsoft. Caracter&iacute;sticas: Ambiente gr&aacute;fico m&aacute;s agradable que  el de sus predecesores. Secuencias m&aacute;s r&aacute;pidas de inicio y de hibernaci&oacute;n.</p>
  <p align="justify"><strong>2002</strong> <strong>GNULINEX</strong> Es una distribuci&oacute;n  Linux libre basada en Debian GNU/Linux y GNOME, contando conOpenOffice.org como  suite ofim&aacute;tica, entre otras aplicaciones. Kernel versi&oacute;n 2.6.32. Con soporte  para recientes tarjetas de red inal&aacute;mbricas. Entorno de escritorio: Gnome 2.2. Gestor  de arranque: Grub2. Navegador web Firefox 3.6.10 auto actualizable. Acceso  r&aacute;pido a redes sociales.</p>
  <p align="justify"><strong>2003</strong> <strong>Windows Server 2003</strong> Es un SO  de la familia Windows de la marca Microsoft para servidores que sali&oacute; al  mercado en el a&ntilde;o 2003. Est&aacute; basada en tecnolog&iacute;a NT y su versi&oacute;n del n&uacute;cleo NT  es la 5.2.</p>
  <p align="justify"><strong>2006</strong> <strong>WINDOWS VISTA</strong> Este SO una  versi&oacute;n de Windows desarrollada por Microsoft. Esta versi&oacute;n se enfoca para ser  utilizada en equipos de escritorio en hogares y oficinas, equipos port&aacute;tiles,  tabletas y equipos media center. </p>
  <p align="justify"><strong>2007</strong> <strong>Mac OS X v10.5</strong> denominado  Leopard es la sexta versi&oacute;n del SO de Apple, Mac OS X, para computadoras de  escritorio y servidores Macintosh. C ubriendo componentes del n&uacute;cleo del  sistema operativo, as&iacute; como tambi&eacute;n las aplicaciones incluidas y las  herramientas de desarrollo.</p>
  <p align="justify"><strong>2008</strong> <strong>Windows Server 2008</strong> Es el  nombre de un SO de Microsoft dise&ntilde;ado para servidores. Es el sucesor de Windows  Server 2003, distribuido al p&uacute;blico casi cinco a&ntilde;os despu&eacute;s. Al igual que  Windows 7.</p>
  <p align="justify"><strong>2009</strong> <strong>JNode</strong> es un SO totalmente hecho en Java, a excepci&oacute;n de una m&iacute;nima cantidad de c&oacute;digo  en assembler. El objetivo consiste en desarrollar un sistema operativo para uso  personal en el que cualquier aplicaci&oacute;n pueda correr de manera r&aacute;pida y segura.</p>
  <p align="justify"><strong>Windows 7</strong> Es una versi&oacute;n de Microsoft Windows, l&iacute;nea de SO producida por  Microsoft Corporation. Esta versi&oacute;n est&aacute; dise&ntilde;ada para uso en PC, incluyendo  equipos de escritorio en hogares y oficinas, equipos port&aacute;tiles, Tablet PC,  netbooks y equipos media center.</p>
  <p align="justify"><strong>2012</strong> <strong>Windows 8</strong> E s la versi&oacute;n  actual del SO de Microsoft Windows, producido por Microsoft para su uso en  computadoras personales, su acomodo de todas los datos de la computadora es  diferente a lo que hab&iacute;amos visto en versiones anteriores.  </p>
  <p align="justify"><strong>2015</strong> El primero de junio de 2015, la aplicaci&oacute;n Obtener <strong>Windows 10</strong> (GWX) fue activado en los dispositivos Windows que  ejecutan versiones id&oacute;neas para actualizar, y compatibles con, Windows 10.</p>
  <p align="justify"><strong>2016</strong> <strong>Windows 10 Redstone</strong> 1 ser&aacute;  la primera gran actualizaci&oacute;n de Windows 10, fue anunciada en abril de 2015, y  comenz&oacute; su desarrollo en octubre de 2015. Posiblemente su lanzamiento sea en  dos etapas, una en la temporada de verano de 2016 que se concentrar&aacute; mayormente  en mejorar el n&uacute;cleo compartido de Windows (OneCore), en la plataforma  universal de Windows o UWP, con lo que la Windows Store incluir&aacute; la tienda de  Xbox One y Xbox 360 y la llegada de m&aacute;s aplicaciones del Proyecto Centennial e  IslandWood hacen parte del paquete que vendr&aacute; con la actualizaci&oacute;n. </p>
  <p align="justify"><strong>2017</strong> Lanzamiento oficial de la &uacute;ltima versi&oacute;n de Windows 10, llamada <strong>Creators Update</strong>.</p>
</form>
<form id="form2" name="form2" method="post" action="">
  <div align="center"><img src="linea.jpg" width="753" height="1502" />
  </div>
</form>
<form id="form3" name="form3" method="post" action="">
  <p align="justify"><span class="Estilo1"><strong>Tabla de Frecuencias  de la evoluci&oacute;n del Sistema Operativo. (1956-2019)</strong><br />
  La frecuencia de un evento, es el n&uacute;mero de  veces en que dicho evento se repite durante un experimento o muestra  estad&iacute;stica.<br />
  <strong>Media para  datos no agrupados:<br />
  </strong>Es la suma de todos los datos, dividido en el  n&uacute;mero total de datos.</span></p>
  <table width="105" border="0">
    <tr>
      <td><img src="media.jpg" width="99" height="74" /></td>
    </tr>
  </table>
  <p align="justify" class="Estilo1"><strong>Mediana para datos  no agrupados:<br />
    </strong>Para un conjunto de datos ordenados en forma  ascendente o descendente, la mediana es el valor central de los datos.<br />
    <strong>Moda para datos  no agrupados:<br />
    </strong>Es el valor que aparece con mayor frecuencia  en un conjunto de datos.<br />
    <strong>Sistemas  operativos con respecto a las d&eacute;cadas&nbsp; </strong></p>
  <table width="200" border="0">
    <tr>
      <td><img src="media01.jpg" width="270" height="224" /></td>
      <td><img src="media02.jpg" width="211" height="122" /></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <table width="200" border="0">
    <tr>
      <td><img src="media03.jpg" width="759" height="391" /></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <p align="justify" class="Estilo1">&nbsp;</p>
</form>
</body>

</html>
