<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #CC9900;
}
.Estilo2 {font-family: "Century Gothic"}
.Estilo3 {
	font-family: "Century Gothic";
	font-size: 24px;
	font-weight: bold;
}
-->
</style></head>

<body>
<form id="form1" name="form1" method="post" action="">
  <h3 align="center" class="Estilo3">FUNCI&Oacute;N DE LOS SISTEMAS OPERATIVO</h3>
  <p class="Estilo2"><strong>1 Gesti&oacute;n de procesos:</strong> Una  de las partes m&aacute;s importantes de un sistema operativo es la gesti&oacute;n de los  procesos. Los procesos son los recursos que necesita un programa para  ejecutarse. Esto implica el uso de la memoria, del tiempo del CPU (unidad  central de procesamiento) y los archivos a los que necesita acceso la  aplicaci&oacute;n para funcionar bien. </p>
  <p class="Estilo2"><strong>2 Gesti&oacute;n de la memoria principal: </strong>Otro de los componentes importantes del sistema operativo es  la gesti&oacute;n de la memoria principal. La memoria consiste en un almac&eacute;n de datos  que es compartido por la CPU y las aplicaciones y que pierde su capacidad si  surge alg&uacute;n fallo.<br />
    <br />
    <strong>3 <strong>Gesti&oacute;n del almacenamiento secundario: </strong></strong>La memoria es algo muy vol&aacute;til y ante cualquier fallo puede  perder la informaci&oacute;n contenida en ella. Por esto, es necesario tener un  segundo m&oacute;dulo de almacenamiento que pueda almacenar los datos a largo plazo. <br />
    Al igual que con la memoria principal, el sistema operativo se  encarga de gestionar el espacio libre y asigna el orden de guardado. Tambi&eacute;n se  asegura de que todo quede perfectamente guardado, as&iacute; como de cu&aacute;nto espacio  queda libre y d&oacute;nde.<br />
    <br />
    <strong>4<strong> Gesti&oacute;n del sistema de entrada y salida</strong></strong>: El sistema operativo es el encargado de  gestionar los puertos de entrada y salida del ordenador, como pueden ser unos  auriculares, una impresora, un monitor, etc. <br />
    Antiguamente, cuando quer&iacute;as instalar un nuevo puerto externo, era  importante tener un disco de instalaci&oacute;n que contuviera los drivers para que el  ordenador los aceptase. <br />
    <strong><br />
    5 <strong>Registro del sistema de archivos</strong></strong>: Los archivos son formatos creados por  sus due&ntilde;os que se convierten en tablas, y el sistema operativo es el encargado  de registrarlas y guardarlas. <br />
    El sistema operativo se encarga de construir, eliminar y archivar  los archivos creados, as&iacute; como de ofrecer las herramientas necesarias para  poder acceder a los archivos en cualquier momento. <br />
    Establece la comunicaci&oacute;n entre los archivos y las unidades de  almacenamiento, y por &uacute;ltimo, se puede configurar de manera que haga copias de  seguridad de todos los archivos, para que en caso de accidente, no se pierdan  todos.<br />
    <strong><br />
    6</strong> <strong>Seguridad: </strong>El sistema operativo es  el encargado de la seguridad de la m&aacute;quina. Una de las actividades m&aacute;s  importantes es el acceso de usuarios o programas a donde no deben. <br />
    Existen muchos virus que pueden afectar a nuestro sistema, y el  sistema operativo se encarga de que esto no suceda. <br />
  Se puede configurar el sistema operativo de manera que se realicen  controles peri&oacute;dicos y se establezcan los controles de seguridad que tiene que  realizar.<br />
  <strong><br />
    7</strong> <strong>Comunicaci&oacute;n entre elementos y aplicaciones</strong>: A trav&eacute;s de las interfaces de red, el  sistema operativo mantiene la comunicaci&oacute;n entre los distintos componentes de  la m&aacute;quina y todas las aplicaciones que est&eacute;n en contacto con ellos.&nbsp;Env&iacute;a  y recibe informaci&oacute;n.<br />
    <strong><br />
    8<strong> Informar del estado del sistema</strong></strong>: Existen una serie de aplicaciones que  vienen instaladas por defecto junto al sistema operativo, pero que no son un  sistema como tal. <br />
    Estas ofrecen un entorno y unas caracter&iacute;sticas b&aacute;sicas para el  desarrollo y la ejecuci&oacute;n de los programas que est&aacute;n instalados en nuestra  m&aacute;quina. <br />
    Informa del estado del sistema, si se necesita realizar alguna  acci&oacute;n o aprobar que se realice alguna acci&oacute;n, como pueden ser las  actualizaciones autom&aacute;ticas. <br />
    <strong><br />
  9 <strong>Gesti&oacute;n de recursos</strong></strong>: Administra todas las partes principales  de la m&aacute;quina a trav&eacute;s de su gestor de recursos. Su funci&oacute;n como administrador  conlleva la seguridad y comunicaci&oacute;n de la unidad central de procesamiento o  CPU, los dispositivos externos que son conectados al ordenador. <br />
  Al igual que la memoria interna y la memoria secundaria, donde a  veces tiene que hacer limpieza y cambiar partes almacenadas de una a  otra.&nbsp; <br />
    En general, administra todos los recursos del sistema y todos los  recursos que entran en contacto con el mismo<br />
    <strong><br />
  10 <strong>Administraci&oacute;n de usuarios:</strong></strong> El sistema operativo tambi&eacute;n es el  encargado de gestionar los perfiles almacenados en el ordenador dependiendo de  quien tenga creado un perfil en &eacute;l. <br />
  La administraci&oacute;n de usuarios puede ser monousuario o  multiusuario. Esto no significa que el sistema operativo permita que s&oacute;lo se  cree un perfil de usuario para utilizar en un ordenador. <br />
  Que sea un perfil de monousuario implica que s&oacute;lo las ejecuciones  de ese usuario est&eacute;n activas y solo las de &eacute;l. En el otro, en el multiusuario,  permite que las tareas de m&aacute;s de un usuario est&eacute;n activas al mismo tiempo. </p>
</form>
<form id="form2" name="form2" method="post" action="">
  <div align="center"><img src="tabla01.jpg" width="372" height="1100" />
  </div>
</form>
<form id="form3" name="form3" method="post" action="">
  <p align="justify"><span class="Estilo3">FRECUENCIA  PARA DATOS NO AGRUPADOS<br />
  </span><span class="Estilo2"><br />
  Es el conjunto de datos obtenidos en  la recopilaci&oacute;n y una vez que se han recopilado los datos, el siguiente paso es  organizarlos. </span></p>
  <p align="justify" class="Estilo2"><strong>TABLA DE FRECUENCIAS</strong><br />
    Lo datos estad&iacute;sticos obtenidos  durante la recopilaci&oacute;n se organiza en una tabla llamada &ldquo;Tabla de frecuencias  o distribuci&oacute;n de frecuencias simple&rdquo;.</p>
  <p align="justify" class="Estilo2"><strong>FRECUENCIA</strong><br />
    A un grupo de 31 alumnos se les hizo  una encuesta pregunt&aacute;ndoles cual es el sistema operativo que utilizan con m&aacute;s  frecuencia y estos fueron los resultados.</p>
  <p align="center" class="Estilo2"><img src="tabla02.jpg" width="370" height="189" /></p>
  <p align="center" class="Estilo2"><img src="pastel01.jpg" width="418" height="365" /></p>
</form>
</body>
</html>
